# importing the enron data as a unix file
### finding the answers of the questions in chapter dataset questions

In [1]:
import pickle

enron_data = pickle.load(open("../final_project/final_project_dataset_unix.pkl", "rb"))

import pandas as pd 
df = pd.DataFrame(enron_data)

In [2]:
df.head()

,METTS MARK,BAXTER JOHN C,ELLIOTT STEVEN,CORDES WILLIAM R,HANNON KEVIN P,MORDAUNT KRISTINA M,MEYER ROCKFORD G,MCMAHON JEFFREY,HAEDICKE MARK E,PIPER GREGORY F,...,SAVAGE FRANK,IZZO LAWRENCE L,TILNEY ELIZABETH A,MARTIN AMANDA K,BUY RICHARD B,GRAMM WENDY L,CAUSEY RICHARD A,TAYLOR MITCHELL S,DONAHUE JR JEFFREY M,GLISAN JR BEN F
salary,365788,267102,170941,NaN,243293,267093,NaN,370448,374125,197091,...,NaN,85274,247338,349487,330546,NaN,415189,265214,278601,274975
to_messages,807,NaN,NaN,764,1045,NaN,232,2355,4009,1238,...,NaN,496,460,1522,3523,NaN,1892,533,865,873
deferral_payments,NaN,1295738,NaN,NaN,NaN,NaN,1848227,NaN,2157527,1130036,...,NaN,NaN,NaN,85430,649584,NaN,NaN,227449,NaN,NaN
total_payments,1061827,5634343,211725,NaN,288682,628522,1848227,4099771,3859065,1737629,...,3750,1979596,399393,8407016,2355702,119292,1868758,1092663,875760,1272284
loan_advances,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

#### How many POIs are there in the E+F dataset?

to find this first we need to transpose the data to make names in rows and features of every person in columns.

In [3]:
df = df.transpose()

In [4]:
df['poi'].sum()

18

### Some preprocessing

In [5]:
df.reset_index(inplace = True)

In [6]:
df = df.rename({'index': 'name'}, axis=1)

In [7]:
df.head()

,name,salary,to_messages,deferral_payments,total_payments,loan_advances,bonus,email_address,restricted_stock_deferred,deferred_income,...,from_poi_to_this_person,exercised_stock_options,from_messages,other,from_this_person_to_poi,poi,long_term_incentive,shared_receipt_with_poi,restricted_stock,director_fees
0,METTS MARK,365788,807,NaN,1061827,NaN,600000,mark.metts@enron.com,NaN,NaN,...,38,NaN,29,1740,1,False,NaN,702,585062,NaN
1,BAXTER JOHN C,267102,NaN,1295738,5634343,NaN,1200000,NaN,NaN,-1386055,...,NaN,6680544,NaN,2660303,NaN,False,1586055,NaN,3942714,NaN
2,ELLIOTT STEVEN,170941,NaN,NaN,211725,NaN,350000,steven.elliott@enron.com,NaN,-400729,...,NaN,4890344,NaN,12961,NaN,False,NaN,NaN,1788391,NaN
3,CORDES WILLIAM R,NaN,764,NaN,NaN,NaN,NaN,bill.cordes@enron.com,NaN,NaN,...,10,651850,12,NaN,0,False,NaN,58,386335,NaN
4,HANNON KEVIN P,243293,1045,NaN,288682,NaN,1500000,kevin.hannon@enron.com,NaN,-3117011,...,32,5538001,32,11350,21,True,1617011,1035,853064,NaN

In [8]:
names = pd.read_csv('../final_project/poi_names.txt', delimiter = ',',skiprows = 1)

In [9]:
names['yes/no'] = ""
for i in names.index:
    names['yes/no'][i] = names['first_name'][i].split(')')[0].strip("(")

In [10]:
for i in names.index:
    names['first_name'][i] = names['first_name'][i].split(')')[1].strip()

In [11]:
names["full_name"] = ""
for i in names.index:
    names['full_name'] =  names['last_name'] + " "+ names['first_name'].astype(str)

In [12]:
names.head()

  first_name last_name yes/no          full_name
0        Lay   Kenneth      y        Kenneth Lay
1   Skilling   Jeffrey      y   Jeffrey Skilling
2     Howard     Kevin      n       Kevin Howard
3     Krautz   Michael      n     Michael Krautz
4     Yeager     Scott      n       Scott Yeager

In [13]:
poi_list = list(names['full_name'].str.lower())

#### how many POIs exists?

In [14]:
len(poi_list)

35

### What is the total value of the stock belonging to James Prentice?

In [15]:
df['name'] = df['name'].str.lower()

In [16]:
df[df['name']== 'prentice james']['total_stock_value']

98    1095040
Name: total_stock_value, dtype: object

In [17]:
df.columns

Index(['name', 'salary', 'to_messages', 'deferral_payments', 'total_payments',
       'loan_advances', 'bonus', 'email_address', 'restricted_stock_deferred',
       'deferred_income', 'total_stock_value', 'expenses',
       'from_poi_to_this_person', 'exercised_stock_options', 'from_messages',
       'other', 'from_this_person_to_poi', 'poi', 'long_term_incentive',
       'shared_receipt_with_poi', 'restricted_stock', 'director_fees'],
      dtype='object')

#### How many email messages do we have from Wesley Colwell to persons of interest?

In [18]:
df[df['name'] == 'colwell wesley']['from_this_person_to_poi']

16    11
Name: from_this_person_to_poi, dtype: object

#### What’s the value of stock options exercised by Jeffrey K Skilling?

In [19]:
df[df['name'] == 'skilling jeffrey k']['exercised_stock_options']

95    19250000
Name: exercised_stock_options, dtype: object

#### Of these three individuals (Lay, Skilling and Fastow), who took home the most money (largest value of “total_payments” feature)?

#### How much money did that person get?

In [20]:
import numpy as np
total = df['total_payments'].astype('float').unique()
t = total[~np.isnan(total)].astype('int64').max()

In [21]:
df[df['total_payments'] == 309886585]

,name,salary,to_messages,deferral_payments,total_payments,loan_advances,bonus,email_address,restricted_stock_deferred,deferred_income,...,from_poi_to_this_person,exercised_stock_options,from_messages,other,from_this_person_to_poi,poi,long_term_incentive,shared_receipt_with_poi,restricted_stock,director_fees
103,total,26704229,NaN,32083396,309886585,83925000,97343619,NaN,-7576788,-27992891,...,NaN,311764000,NaN,42667589,NaN,False,48521928,NaN,130322299,1398517

In [22]:
df[df['name'] == 'skilling jeffrey k']['total_payments']

95    8682716
Name: total_payments, dtype: object

In [23]:
df[df['name'] == 'fastow andrew s']['total_payments']

85    2424083
Name: total_payments, dtype: object

In [24]:
df[df['name'] == 'lay kenneth l']['total_payments']

64    103559793
Name: total_payments, dtype: object

#### How many folks in this dataset have a quantified salary? What about a known email address?

In [25]:
146 - sum(df['salary'].astype('str') == 'NaN')

95

In [26]:
146 - sum(df['email_address'] == 'NaN')

111

#### How many people in the E+F dataset (as it currently exists) have “NaN” for their total payments? What percentage of people in the dataset as a whole is this?

In [27]:
nan_payments = sum(df['total_payments'].astype('str') == 'NaN')
nan_payments

21

In [28]:
percentage = (nan_payments / 146)* 100
percentage

14.383561643835616

#### How many POIs in the E+F dataset have “NaN” for their total payments? What percentage of POI’s as a whole is this?

In [29]:
df[df.poi == True]['total_payments'].isna().sum()

0

##### If you added in, say, 10 more data points which were all POI’s, and put “NaN” for the total payments for those folks, the numbers you just calculated would change.
What is the new number of people of the dataset? What is the new number of folks with “NaN” for total payments?

In [30]:
#new number of people is 146+10 

146+10

156

In [31]:
nan_payments +10

31

In [32]:
(31/156)*100  #percentage

19.871794871794872

#### What is the new number of POI’s in the dataset? What is the new number of POI’s with NaN for total_payments?

In [33]:
10 + df['poi'].sum()

28

In [34]:
10

10

In [35]:
(10/28)*100

35.714285714285715

In [36]:
df.columns

Index(['name', 'salary', 'to_messages', 'deferral_payments', 'total_payments',
       'loan_advances', 'bonus', 'email_address', 'restricted_stock_deferred',
       'deferred_income', 'total_stock_value', 'expenses',
       'from_poi_to_this_person', 'exercised_stock_options', 'from_messages',
       'other', 'from_this_person_to_poi', 'poi', 'long_term_incentive',
       'shared_receipt_with_poi', 'restricted_stock', 'director_fees'],
      dtype='object')